Revit 2024 API
Curve.Intersect Method
Calculates the intersection of this curve with the specified curve.
Overload List
Name | Description
Intersect(Curve)
Calculates the intersection of this curve with the specified curve.
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of this curve with the specified curve and returns the intersection results.
See Also
Curve Class
Curve Members
Autodesk.Revit.DB Namespace